# VSave

## Description
Procedure VSave saves the current VectorWorks document view.

```pascal
PROCEDURE VSave(name : STRING);
```

```python
def vs.VSave(name):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|Name of view to save.|

## Version
Availability: from All Versions

## Category
* View @ Zoom